Running plan in the remote backend. Output will stream here. Pressing Ctrl-C will stop streaming the logs, but will not stop the plan running remotely.  Preparing the remote plan...  To view this run in a browser, visit: https://app.terraform.io/app/electric/learn-terraform-circleci/runs/run-fXNU8zpDihcJFzWe  Waiting for the plan to start...  Terraform v0.12.26 Configuring remote state backend... Initializing Terraform configuration... 2020/06/02 18:36:58 [DEBUG] Using modified User-Agent: Terraform/0.12.26 TFC/d331f267e4 Refreshing Terraform state in-memory prior to plan... The refreshed state will be used to calculate this plan, but will not be persisted to local or remote state storage.   ------------------------------------------------------------------------  An execution plan has been generated and is shown below. Resource actions are indicated with the following symbols:   + create  <= read (data resources)  Terraform will perform the following actions:    # data.template_file.circleci_policy will be read during apply   # (config refers to values not yet known)  <= data "template_file" "circleci_policy"  {       + id       = (known after apply)       + rendered = (known after apply)       + template = jsonencode(             {               + Statement = [                   + {                       + Action   = [                           + "s3:*",                         ]                       + Effect   = "Allow"                       + Resource = "${s3_bucket_arn}"                     },                 ]               + Version   = "2012-10-17"             }         )       + vars     = {           + "s3_bucket_arn" = (known after apply)         }     }    # aws_iam_access_key.circleci will be created   + resource "aws_iam_access_key" "circleci" {       + encrypted_secret     = (known after apply)       + id                   = (known after apply)       + key_fingerprint      = (known after apply)       + secret               = (sensitive value)       + ses_smtp_password    = (sensitive value)       + ses_smtp_password_v4 = (sensitive value)       + status               = (known after apply)       + user                 = "circle-user"     }    # aws_iam_user.circleci will be created   + resource "aws_iam_user" "circleci" {       + arn           = (known after apply)       + force_destroy = false       + id            = (known after apply)       + name          = "circle-user"       + path          = "/system/"       + unique_id     = (known after apply)     }    # aws_iam_user_policy.circleci will be created   + resource "aws_iam_user_policy" "circleci" {       + id     = (known after apply)       + name   = "AllowCircleCI"       + policy = (known after apply)       + user   = "circle-user"     }    # aws_s3_bucket.portfolio will be created   + resource "aws_s3_bucket" "portfolio" {       + acceleration_status         = (known after apply)       + acl                         = "public-read"       + arn                         = (known after apply)       + bucket                      = "*************"       + bucket_domain_name          = (known after apply)       + bucket_regional_domain_name = (known after apply)       + force_destroy               = true       + hosted_zone_id              = (known after apply)       + id                          = (known after apply)       + region                      = (known after apply)       + request_payer               = (known after apply)       + tags                        = {           + "Name" = "Portfolio Website Bucket"         }       + website_domain              = (known after apply)       + website_endpoint            = (known after apply)        + versioning {           + enabled    = (known after apply)           + mfa_delete = (known after apply)         }        + website {           + error_document = "error.html"           + index_document = "terramino.html"         }     }    # local_file.circle_credentials will be created   + resource "local_file" "circle_credentials" {       + content              = (known after apply)       + directory_permission = "0777"       + file_permission      = "0777"       + filename             = "tmp/circleci_credentials"       + id                   = (known after apply)     }  Plan: 5 to add, 0 to change, 0 to destroy. 